** Variables
In prolog we can not only name particular objects, but also can use terms like X to stand for objects that we can unwilling or unable to name.
Terms of this second kind are called /variables/.
When Prolog used a variable, the vairable can be either /instaniated/ or /not instantiated./
When prolog is asked a question containing a variable, Prolog searches through all its facts to find an object that the variable could stand for.
#+BEGIN_SRC prolog
likes(john, flowers).
likes(john, mary).
likes(paul, mary).

?- likes(john, X).
#+END_SRC

#+RESULTS:
: X = flowers
How does this work? When prolog is adked this question, the variable X is initially not instantiated. Prolog searches through the database, looking for a fact that unifies with the question.
Now if an uninstantiated variable Prolog will allow that argument to unify with any other argument in the same position in the fact.
We say that X is instantiated to flowers. Prolog not marks the place in the database where a unifier is found.
Now if we press Enter key, meaning we are satisifed with just one answer, then Prolog will stop searching for more.If instead we press the semicolon key ";", Prolog will resume its search through the database as before.
starting from where it /left the place-marker/, to find another possible answer to the question.
When prolog begins searching from a place-marker instead of from the beginning of the database, we say that prolog is attempting to re-satisfy yhe question.
